<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://docs.jamf.com/jamf-connect/administrator-guide/index.html</string>
	<key>pfm_description</key>
	<string>Jamf Connect Verify settings</string>
	<key>pfm_documentation_url</key>
	<string>https://docs.jamf.com/jamf-connect/1.2.3/administrator-guide/Jamf_Connect_Login.html</string>
	<key>pfm_domain</key>
	<string>com.jamf.connect.verify</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-08-15T08:00:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Jamf Connect Verify configuration settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Jamf Connect Verify configuration</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.jamf.connect.verify</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.jamf.connect.verify</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the IdP provider integrated with Jamf Connect Verify.</string>
			<key>pfm_hidden</key>
			<string>all</string>
			<key>pfm_name</key>
			<string>OIDCProvider</string>
			<key>pfm_range_list</key>
			<array>
				<string>Azure</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Azure</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Client ID of the added app in your IdP used for authenticating the user's password via a resource owner password grant (ROPG) workflow.</string>
			<key>pfm_description_reference</key>
			<string>The Client ID of the added app in your IdP used for authenticating the user's password via a resource owner password grant (ROPG) workflow.
Note: If using Jamf Connect Login, you can use the same Client ID for both apps.</string>
			<key>pfm_name</key>
			<string>OIDCROPGID</string>
			<key>pfm_note</key>
			<string>If using Jamf Connect Login, you can use the same Client ID for both apps.</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>9fcc52c7-ee36-4889-8517-lkjslkjoe23</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Password</string>
				<string>Kerberos</string>
				<string>Keychain</string>
				<string>Menu</string>
				<string>Additional Messaging</string>
				<string>Open ID Connect</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Additional Messaging</key>
				<array>
					<string>MessageBrowserPasswordChange</string>
					<string>MessageLocalSync</string>
					<string>MessageNetworkPasswordWrong</string>
					<string>WindowAbout</string>
					<string>WindowSignIn</string>
				</array>
				<key>General</key>
				<array>
					<string>DontShowWelcome</string>
					<string>FailToolPath</string>
					<string>ForceSignInWindow</string>
					<string>GetHelpType</string>
					<string>GetHelpOptions</string>
					<string>LoginLogo</string>
					<string>SelfServicePath</string>
				</array>
				<key>Kerberos</key>
				<array>
					<string>KerberosGetTicketsAutomatically</string>
					<string>KerberosRealm</string>
					<string>KerberosShowCountdown</string>
					<string>KerberosShowCountdownLimit</string>
					<string>TimerKerberosCheck</string>
				</array>
				<key>Keychain</key>
				<array>
					<string>KeychainItems</string>
					<string>KeychainItemsDebug</string>
					<string>KeychainItemsCreateSerial</string>
					<string>KeychainItemsInternet</string>
				</array>
				<key>Menu</key>
				<array>
					<string>PFC_SegmentedControl_1</string>
					<string>Version</string>
					<string>MenuIcon</string>
					<string>MenuText</string>
					<string>HideAbout</string>
					<string>HideChangePassword</string>
					<string>HideGetHelp</string>
					<string>HideGetSoftware</string>
					<string>HideHomeDirectory</string>
					<string>HideLastUser</string>
					<string>HidePrefs</string>
					<string>HideResetPassword</string>
					<string>HideShares</string>
					<string>HideSignIn</string>
					<string>HideTickets</string>
					<string>HideQuit</string>
					<string>MenuAbout</string>
					<string>MenuActions</string>
					<string>MenuChangePassword</string>
					<string>MenuGetHelp</string>
					<string>MenuGetSoftware</string>
					<string>MenuHomeDirectory</string>
					<string>MenuKerberosTickets</string>
					<string>MenuResetPassword</string>
					<string>MenuShares</string>
					<string>MenuIconActive</string>
					<string>MenuIconDark</string>
				</array>
				<key>Open ID Connect</key>
				<array>
					<string>OIDCROPGID</string>
					<string>OIDCClientSecret</string>
					<string>OIDCChangePasswordURL</string>
					<string>OIDCLoginURL</string>
					<string>OIDCProvider</string>
					<string>OIDCRedirectURI</string>
					<string>OIDCResetPasswordURL</string>
				</array>
				<key>Password</key>
				<array>
					<string>TimerLocalCheck</string>
					<string>TimerNetworkCheck</string>
					<string>LocalPasswordIgnore</string>
					<string>NetworkCheckAutomatically</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Jamf Connect Sync splash screen on launch.</string>
			<key>pfm_name</key>
			<string>DontShowWelcome</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies a path to a custom tool to use on password failure.</string>
			<key>pfm_name</key>
			<string>FailToolPath</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines if the sign in window should stay open until the user has successfully authenticated.</string>
			<key>pfm_name</key>
			<string>ForceSignInWindow</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>The type of Get Help menu, such as a URL, path or app.</string>
			<key>pfm_name</key>
			<string>GetHelpType</string>
			<key>pfm_range_list</key>
			<array>
				<string>URL</string>
				<string>Path</string>
				<string>App</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Specifies the URL or path for GetHelpType. &lt;&lt;serial&gt;&gt;, &lt;&lt;fullname&gt;&gt;, &lt;&lt;shortname&gt;&gt; and &lt;&lt;domain&gt;&gt; are supported as substitutions.</string>
			<key>pfm_description_reference</key>
			<string>Specifies the URL or path for GetHelpType. &lt;&lt;serial&gt;&gt;, &lt;&lt;fullname&gt;&gt;, &lt;&lt;shortname&gt;&gt; and &lt;&lt;domain&gt;&gt; are supported as substitutions
Note: The GetHelpType key must be specified.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>GetHelpType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>GetHelpOptions</string>
			<key>pfm_substitution_variables</key>
			<dict>
				<key>&lt;&lt;domain&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>AD Domain.</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
					<key>pfm_value_placeholder</key>
					<string>example.com</string>
				</dict>
				<key>&lt;&lt;fullname&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>Full Name of the current user.</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
					<key>pfm_value_placeholder</key>
					<string>John Doe</string>
				</dict>
				<key>&lt;&lt;serial&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>Serial Number of the device.</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
					<key>pfm_value_placeholder</key>
					<string>C02LL3M2FH01</string>
				</dict>
				<key>&lt;&lt;shortname&gt;&gt;</key>
				<dict>
					<key>pfm_description</key>
					<string>Shortname of the current user.</string>
					<key>pfm_substitution_source</key>
					<string>local</string>
					<key>pfm_value_placeholder</key>
					<string>johndoe</string>
				</dict>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Applications/Google Chrome.app</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies an image to display in the authentication window.</string>
			<key>pfm_name</key>
			<string>LoginLogo</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/images/logo.png</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies the file path for a Self Service application not found automatically.</string>
			<key>pfm_name</key>
			<string>SelfServicePath</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Applications/Your.app</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Image to use when the icon is active.</string>
			<key>pfm_name</key>
			<string>MenuIconActive</string>
			<key>pfm_note</key>
			<string>A 16x16 pixel image is recommended.</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/images/icon.png</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Image to use for the menu icon in dark mode.</string>
			<key>pfm_name</key>
			<string>MenuIconDark</string>
			<key>pfm_note</key>
			<string>A 16x16 pixel image is recommended.</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/usr/local/images/icon.png</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_1</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Menu Items</string>
				<string>Menu Titles</string>
				<string>Menu Actions</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Menu Actions</key>
				<array>
					<string>Version</string>
					<string>MenuIcon</string>
					<string>MenuText</string>
				</array>
				<key>Menu Items</key>
				<array>
					<string>HideAbout</string>
					<string>HideChangePassword</string>
					<string>HideGetHelp</string>
					<string>HideGetSoftware</string>
					<string>HideHomeDirectory</string>
					<string>HideLastUser</string>
					<string>HidePrefs</string>
					<string>HideResetPassword</string>
					<string>HideShares</string>
					<string>HideSignIn</string>
					<string>HideTickets</string>
					<string>HideQuit</string>
				</array>
				<key>Menu Titles</key>
				<array>
					<string>MenuAbout</string>
					<string>MenuActions</string>
					<string>MenuChangePassword</string>
					<string>MenuGetHelp</string>
					<string>MenuGetSoftware</string>
					<string>MenuHomeDirectory</string>
					<string>MenuKerberosTickets</string>
					<string>MenuResetPassword</string>
					<string>MenuShares</string>
					<string>MenuIconActive</string>
					<string>MenuIconDark</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the About window.</string>
			<key>pfm_name</key>
			<string>HideAbout</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Change Password menu item.</string>
			<key>pfm_name</key>
			<string>HideChangePassword</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Get Help menu.</string>
			<key>pfm_name</key>
			<string>HideGetHelp</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Get Software menu.</string>
			<key>pfm_name</key>
			<string>HideGetSoftware</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the home directory menu item.</string>
			<key>pfm_name</key>
			<string>HideHomeDirectory</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the last user menu item.</string>
			<key>pfm_name</key>
			<string>HideLastUser</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Preferences menu item.</string>
			<key>pfm_name</key>
			<string>HidePrefs</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the reset password menu item.</string>
			<key>pfm_name</key>
			<string>HideResetPassword</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the shares menu.</string>
			<key>pfm_name</key>
			<string>HideShares</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Sign in menu item.</string>
			<key>pfm_name</key>
			<string>HideSignIn</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Tickets menu item.</string>
			<key>pfm_name</key>
			<string>HideTickets</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Hides the Quit menu item.</string>
			<key>pfm_name</key>
			<string>HideQuit</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Title of the About menu.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideAbout</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>MenuAbout</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Title of the Actions menu item.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideActions</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>MenuActions</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Title of the Change Password menu item.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideChangePassword</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>MenuChangePassword</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Title of the Get Help menu.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideGetHelp</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>MenuGetHelp</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Title of the Get Software menu.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideGetSoftware</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>MenuGetSoftware</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Title of the Home share menu.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideHomeDirectory</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>MenuHomeDirectory</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Title of the Kerberos Tickets menu.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideTickets</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>MenuKerberosTickets</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Title of the reset password menu.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideResetPassword</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>MenuResetPassword</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Title of the shares menu.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>HideShares</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>MenuShares</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The numeric version of the preference file. Currently, only "1" is supported.</string>
			<key>pfm_hidden</key>
			<string>all</string>
			<key>pfm_name</key>
			<string>Version</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Determines if the Action menu will display a status icon (green, yellow, or red).</string>
			<key>pfm_description_reference</key>
			<string>Determines if the Action menu will display a status icon (green, yellow, or red)
Note: MenuIcon will display a green, yellow, or red icon next to the main Action menu based upon the "worst" of the visible items in the submenu. For example, if you have any visible submenu actions that have a red icon next to them, the main menu will have a red icon. If any visible submenu actions are yellow and none are red, the main menu item will have a yellow icon.</string>
			<key>pfm_name</key>
			<string>MenuIcon</string>
			<key>pfm_title</key>
			<string>Display status icon on the main Action Menu</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Determines if the text of the main action menu will be the result of the command.</string>
			<key>pfm_description_reference</key>
			<string>Determines if the text of the main action menu will be the result of the command.
Note: MenuText requires a command to return a result of `&lt;&lt;menu&gt;&gt;` followed by your menu. The last command to return a result containing `&lt;&lt;menu&gt;&gt;` will determine what the menu title is.</string>
			<key>pfm_name</key>
			<string>MenuText</string>
			<key>pfm_title</key>
			<string>Display result of command as Action Menu title</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines if Kerberos tickets are automatically retrieved.</string>
			<key>pfm_name</key>
			<string>KerberosGetTicketsAutomatically</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies the Kerberos realm used to get Kerberos tickets.</string>
			<key>pfm_name</key>
			<string>KerberosRealm</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>COMPANY.NET</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Shows the countdown of days remaining until the password expires.</string>
			<key>pfm_name</key>
			<string>KerberosShowCountdown</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An integer, in days remaining, before the password expiration countdown is displayed in the menu bar.</string>
			<key>pfm_description_reference</key>
			<string>An integer, in days remaining, before the password expiration countdown is displayed in the menu bar
Note: To use the KerberosShowCountdownLimit key, the KerberosShowCountdown key must be set to true.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>KerberosShowCountdown</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>KerberosShowCountdownLimit</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>15</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies the frequency, in minutes, that Kerberos tickets are retrieved.</string>
			<key>pfm_name</key>
			<string>TimerKerberosCheck</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>15</string>
			<key>pfm_value_unit</key>
			<string>minutes</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Serial for new keychain item creation.</string>
			<key>pfm_name</key>
			<string>KeychainItemsCreateSerial</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines what keychain items are updated when the user's local password is updated.</string>
			<key>pfm_name</key>
			<string>KeychainItems</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_title</key>
					<string>Keychain Item</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Determines which internet accounts Jamf Connect Verify should synchronize with the local password.</string>
			<key>pfm_name</key>
			<string>KeychainItemsInternet</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Updates keychain items on every sign in. Used for debugging.</string>
			<key>pfm_name</key>
			<string>KeychainItemsDebug</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Determines if the network password is verified automatically</string>
			<key>pfm_name</key>
			<string>NetworkCheckAutomatically</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies the amount of time in minutes between local password verifications.</string>
			<key>pfm_name</key>
			<string>TimerLocalCheck</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>15</string>
			<key>pfm_value_unit</key>
			<string>minutes</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies the amount of time in minutes between network password verifications.</string>
			<key>pfm_name</key>
			<string>TimerNetworkCheck</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>15</string>
			<key>pfm_value_unit</key>
			<string>minutes</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Specifies if local password verification should be ignored. This key is used for testing purposes.</string>
			<key>pfm_name</key>
			<string>LocalPasswordIgnore</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Title of the sign in window.</string>
			<key>pfm_name</key>
			<string>WindowSignIn</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Title of the About window.</string>
			<key>pfm_name</key>
			<string>WindowAbout</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Text shown after the user closes the in-app browser after changing a password.</string>
			<key>pfm_name</key>
			<string>MessageBrowserPasswordChange</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Text shown when the local password is not the same as the network password.</string>
			<key>pfm_name</key>
			<string>MessageLocalSync</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Text shown when the network password is wrong.</string>
			<key>pfm_name</key>
			<string>MessageNetworkPasswordWrong</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Client secret for ROPG operations.</string>
			<key>pfm_name</key>
			<string>OIDCClientSecret</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>URL to the password change page in the IdP.</string>
			<key>pfm_name</key>
			<string>OIDCChangePasswordURL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://www.passwordchangeexample.com</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>URL to sign in to your IdP.</string>
			<key>pfm_name</key>
			<string>OIDCLoginURL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://login.microsoftonline.com</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Redirect URI for ROPG workflow.</string>
			<key>pfm_name</key>
			<string>OIDCRedirectURI</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://127.0.0.1/jamfconnect</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>URL to the password reset page in the IdP.</string>
			<key>pfm_name</key>
			<string>OIDCResetPasswordURL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://www.passwordresetexample.com</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Jamf Connect Verify</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
