<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>SystemUI Server settings</string>
	<key>pfm_domain</key>
	<string>com.apple.systemuiserver</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-08-15T08:00:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures SystemUI Server settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>SystemUI Server</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.systemuiserver</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.systemuiserver</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>List of menu extras to combine with the user's menu bar</string>
			<key>pfm_name</key>
			<string>menuExtras</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>menuExtra</string>
					<key>pfm_range_list</key>
					<array>
						<string>/System/Library/CoreServices/Menu Extras/AirPort.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Battery.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Bluetooth.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Clock.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Displays.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/DwellControl.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Eject.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/ExpressCard.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Ink.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/IrDA.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/PPP.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/PPPoE.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/SafeEjectGPUExtra.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Script</string>
						<string>/System/Library/CoreServices/Menu Extras/Menu.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/TextInput.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/TimeMachine.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/UniversalAccess.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/User.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/VPN.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Volume.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/WWAN.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/iChat.menu</string>
					</array>
					<key>pfm_range_list_allow_custom_value</key>
					<true/>
					<key>pfm_title</key>
					<string>Menu Extra Path</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Menu Extras</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_value_unique</key>
			<true/>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>SystemUI Server</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
